stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL/STM32_BLE/App/app_ble.c
        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }

      gap_cmd_resp_release();

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
      /* USER CODE END EVT_DISCONN_COMPLETE */
    }
    break;

  case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (hci_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
      case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      INT(p_conn_update_complete->Connection_Interval*1.25),
                      FRACTIONAL_2DIGITS(p_conn_update_complete->Connection_Interval*1.25),
                      p_conn_update_complete->Peripheral_Latency,
                      p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(p_conn_update_complete);
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
        }
        break;
      case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);

          gap_cmd_resp_release();

          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
        }
        break;
      case HCI_LE_ENHANCED_CONNECTION_COMPLETE_V2_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_v2_event_rp0 *event;
          event = (hci_le_enhanced_connection_complete_v2_event_rp0 *) p_meta_evt->data;
          connection_complete_event(event->Status,
                                    event->Connection_Handle,
                                    event->Peer_Address_Type,
                                    event->Peer_Address,
                                    event->Connection_Interval,
                                    event->Peripheral_Latency,
                                    event->Supervision_Timeout);
        }
        break;
      case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;

          connection_complete_event(p_conn_complete->Status,
                                    p_conn_complete->Connection_Handle,
                                    p_conn_complete->Peer_Address_Type,
                                    p_conn_complete->Peer_Address,
                                    p_conn_complete->Connection_Interval,
                                    p_conn_complete->Peripheral_Latency,
                                    p_conn_complete->Supervision_Timeout);
        }
        break;
      /* USER CODE BEGIN EVT_LE_META_EVENT_1 */
        
      case HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_V2_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *event;
          event = (hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *) p_meta_evt->data;
          
          APP_DBG_MSG("HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_V2\n");
          
          if(event->Status == 0)
          {
            bleAppContext.Device_Connection_Status = APP_BLE_SYNC;
            ESL_PROFILE_SyncInfoReceived(event->Sync_Handle);
          }
          else
          {
            APP_DBG_MSG("Status %02X\n", event->Status);
          }
        }
        break;
        
      case HCI_LE_PERIODIC_ADVERTISING_REPORT_V2_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_report_v2_event_rp0 *event;
          event = (hci_le_periodic_advertising_report_v2_event_rp0 *)p_meta_evt->data;
          
          //APP_DBG_MSG("HCI_LE_PERIODIC_ADVERTISING_REPORT_V2\n");
          
          if(event->Data_Status == HCI_PADV_DATA_STATUS_COMPLETE && event->Data_Length != 0)
          {
            ESL_PROFILE_AdvPayloadReceived(event->Periodic_Event_Counter, event->Data, event->Data_Length);
          }          
          watchdog_refresh();
        }
        break;
        
      case HCI_LE_PERIODIC_ADVERTISING_SYNC_LOST_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_lost_event_rp0 *event;
          event = (hci_le_periodic_advertising_sync_lost_event_rp0 *)p_meta_evt->data;
          (void) event;
          
          APP_DBG_MSG("HCI_LE_PERIODIC_ADVERTISING_SYNC_LOST\n");
          
          bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
          APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);
        }
        break;

      /* USER CODE END EVT_LE_META_EVENT_1 */

      default:
        /* USER CODE BEGIN SUBEVENT_DEFAULT */
        APP_DBG_MSG("HCI_LE_META_EVT: 0x%02X\n", p_meta_evt->subevent);
        /* USER CODE END SUBEVENT_DEFAULT */
        break;
      }
    } /* HCI_LE_META_EVT_CODE */
    break;

  case HCI_VENDOR_EVT_CODE:
    {
      aci_blecore_event *p_blecore_evt = (aci_blecore_event*) event_data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */

        /* USER CODE END ecode */
      case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
        {
          aci_l2cap_connection_update_resp_event_rp0 *p_l2cap_conn_update_resp;
          p_l2cap_conn_update_resp = (aci_l2cap_connection_update_resp_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_resp);
          /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_RESP */

