stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL/STM32_BLE/App/app_ble.c
      /* Enable advertising */
      status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_enable Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_enable\n");
        
        HAL_RADIO_TIMER_StopVirtualTimer(&(bleAppContext.Advertising_mgr_timer_Id));
        
        /* Start a timer to stop advertising after a while */
        if(ProcGapPeripheralId == PROC_GAP_PERIPH_ADVERTISE_START_FAST)
        {
          HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id, ADV_TIMEOUT_MS);
        }
        else if(ProcGapPeripheralId == PROC_GAP_PERIPH_ADVERTISE_START_LP)
        {
          HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id, ADV_LP_TIMEOUT_MS);
        }
      }
      break;
    }
    case PROC_GAP_PERIPH_ADVERTISE_STOP:
    {
      status = aci_gap_set_advertising_enable(DISABLE, 0, NULL);
      if (status != BLE_STATUS_SUCCESS)
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("Disable advertising - fail, result: 0x%02X\n",status);
      }
      else
      {
        APP_DBG_MSG("==>> Disable advertising - Success\n");
      }
      HAL_RADIO_TIMER_StopVirtualTimer(&(bleAppContext.Advertising_mgr_timer_Id));
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_STOP */
    case PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE:
    {
      Advertising_Set_Parameters_t Advertising_Set_Parameters = {0};

      /* Disable advertising */
      status = aci_gap_set_advertising_enable(DISABLE, 0, NULL);
      if (status != BLE_STATUS_SUCCESS)
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("Disable advertising - fail, result: 0x%02X\n",status);
      }
      else
      {
        APP_DBG_MSG("==>> Disable advertising - Success\n");
      }
      /* Set advertising data */
      status = aci_gap_set_advertising_data(0, ADV_COMPLETE_DATA, sizeof(a_AdvData), (uint8_t*) a_AdvData);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_data Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_data\n");
      }
      /* Enable advertising */
      status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_enable Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_enable\n");
      }
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE */
    case PROC_GAP_PERIPH_CONN_PARAM_UPDATE:
    {
       status = aci_l2cap_connection_parameter_update_req(
                                                       bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                                       paramA,
                                                       paramB,
                                                       paramC,
                                                       paramD);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_l2cap_connection_parameter_update_req - fail, result: 0x%02X\n",status);
      }
      else
      {
        APP_DBG_MSG("==>> aci_l2cap_connection_parameter_update_req - Success\n");
      }

      break;
    }/* PROC_GAP_PERIPH_CONN_PARAM_UPDATE */

    case PROC_GAP_PERIPH_SET_BROADCAST_MODE:
    {

      break;
    }/* PROC_GAP_PERIPH_SET_BROADCAST_MODE */
    default:
      break;
  }
  return;
}

/* USER CODE BEGIN FD*/

/* USER CODE END FD*/

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

static void Adv_Cancel_Req(void *arg)
{
  APP_DBG_MSG("Adv_Cancel_Req\n");
  UTIL_SEQ_SetTask(1 << CFG_TASK_ADV_CANCEL_ID, CFG_SEQ_PRIO_0);
  return;
}

static void Adv_Cancel(void)
{
  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
  bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
  
  watchdog_disable();
  
  return;
}

static void convert_byte_to_ascii_hex(uint8_t byte, char *s)
{
  uint8_t nibble_1 = ((byte & 0xF0)>>4);
  uint8_t nibble_0 = byte & 0xF;
  
  if(nibble_1 >= 0x0A)
  {
    s[0] = nibble_1 - 0x0A + 'A';
  }
  else
  {
    s[0] = nibble_1 + '0';
  }
  
  if(nibble_0 >= 0x0A)
  {
    s[1] = nibble_0 - 0x0A + 'A';
  }
  else
  {
    s[1] = nibble_0 + '0';
  }  
}

static void fill_localName(char * name, const uint8_t* p_bd_addr)
{
  for(uint8_t i = 0; name[i] != '\0' ;i++)
  {
    if(i > 0 && name[i - 1] == 'X' && name[i] == 'X')
    {
      convert_byte_to_ascii_hex(p_bd_addr[0], &name[i - 1]);
      break;
    }
  }    
}

static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t* p_bd_addr)
{
  uint16_t i =0;
  uint8_t ad_length, ad_type;  
  
  while(i < tab_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
      
    switch (ad_type)
    {
    case AD_TYPE_COMPLETE_LOCAL_NAME:
      {        
        if((p_adv_data[i + ad_length] == 'X') && (p_adv_data[i + ad_length - 1] == 'X'))
        {
          convert_byte_to_ascii_hex(p_bd_addr[0], (char *)&p_adv_data[i + ad_length - 1]);
        }
      }
      break;
    default:
      break;
    }
    i += ad_length + 1; /* increment the iterator to go on next element*/
  }
}
/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

void ESL_APP_ProcessRequest(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_ESL_UPD, CFG_SEQ_PRIO_0);
}

void watchdog_enable(void)
{
#ifndef DISABLE_WATCHDOG
  __HAL_RCC_WDG_CLK_ENABLE();
  HAL_IWDG_Refresh(&hiwdg);
#endif
}

void watchdog_disable(void)
{
#ifndef DISABLE_WATCHDOG
  HAL_IWDG_Refresh(&hiwdg);
  __HAL_RCC_WDG_CLK_DISABLE();
#endif
}

void watchdog_refresh(void)
{
#ifndef DISABLE_WATCHDOG
  HAL_IWDG_Refresh(&hiwdg);
#endif
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{    
  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE || bleAppContext.Device_Connection_Status == APP_BLE_ADV_LP)
  {
     /* Relaunch fast advertising */
    
    if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
    {
      watchdog_enable();
    }
    
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);    
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
  }

  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
